# ReverseIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterSet..::..ReverseIterator Method
ParameterSet Class See Also
---
Retrieve a backward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual ParameterSetIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As ParameterSetIterator
```

Visual C++
---
```text
public:
virtual ParameterSetIterator^ ReverseIterator()
```

# ### Return Value
Returns a backward moving iterator to the set.
# See Also
ParameterSet Class
Autodesk.Revit.DB Namespace